-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: May 03, 2025 at 02:06 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `hassan web`
--

-- --------------------------------------------------------

--
-- Table structure for table `content`
--

CREATE TABLE `content` (
  `c_id` int(255) NOT NULL,
  `h_id` int(255) NOT NULL,
  `caption` varchar(1000) NOT NULL,
  `detail` varchar(1000) DEFAULT NULL,
  `img` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `content`
--

INSERT INTO `content` (`c_id`, `h_id`, `caption`, `detail`, `img`) VALUES
(4, 4, 'قال العلامة محمد أمين البغدادي الشهير بـ \"السويدي\" (المتوفى في عام1246 ه‍) في كتابه \"سبائك الذهب في معرفة قبائل العرب\" (ص224) : بنو حسان بطن من كندة.', NULL, NULL),
(5, 4, 'وقال العلامة عبدالرحمن بن عبيد الله السقاف (المتوفي في عام 1375هـ) في كتابه \"إدام القوت في ذكر بلدان حضرموت\" (ص709) : وفي سيئون جماعة من أل حسان، يرجعون في النسب - حسبما يقولون - إلى الشيخ المؤرخ عبدالرحمن بن علي حسان.', NULL, NULL),
(6, 4, 'وقال العلامة علوي بن طاهر الحداد (المتوفي في عام 1382هـ) في كتابه: \"عقود الألماس لمناقب الإمام العارف بالله الحبيب أحمد بن حسن العطاس\" (2/77-78): ثم إن المشايخ آل أبي حسان بيت علم وفضل، يعود نسبهم إلى كندة \"قريش اليمن\"، لم يزل منهم رجال يشار إليهم بالعلم والصلاح، منهم من ترجم له الجندي والخزرجي والطيب بامخرمة، وهاجر بعضهم إلى زبيد، فاشتهر بالعلم والزهد.', NULL, NULL),
(7, 4, 'وقال العلامة محمد بن علي بن عوض باحنان الكندي (المتوفي في عام1383 هـ) في كتابه \"جواهر تاريخ الأحقاف\" (2 /14) : ومن كندة آل أبي حسان.', NULL, NULL),
(8, 3, 'الإمام الفقيه عبدالرحمن بن محمد باحسان الحضرمي الشبامي\r\n', 'ومن الأعيان المذكورين لدى العلامة بهاء الدين الجندي في كتابه \"السلوك في طبقات العلماء والملوك\" الإمام الفقيه عبدالرحمن بن محمد بن عبدالرحمن بن محمد بن أحمد باحسان الحضرمي الشبامي (ت 724هـ)، وكان قدم زبيد وهو ابن أربعين سنة، وتفقه في أبيات حسين ثم سافر إلى مكة المشرفة، فأدرك ابن السبعين وأخذ عن أصحابه. وكانت له يد في التصوف وفي النحو والحديث، وصنف فيها، وكان ورعاً زاهداً عابداً صحب الفقيه إسماعيل الحضرمي وجماعة من أصحاب أبى الغيث بن جميل وابن عجيل. وجاوز عمره مائة سنة لم يتغير له سمع ولا بصر ولا ذهن، وتوفي عن عدة بنات وولد ذكر فتوفي الولد بعد أبيه بمدة يسيرة، وكان وفاة ولده في سنة (727هـ) ولم يكن له من الذكور إلا هذا بعده كما ذكرنا رحمه الله تعالى.\r\nوذكره العلامة علي بن حسن الخزرجي المتوفى سنة (812هـ) في كتابه \"العقود اللؤلؤية في تاريخ الدولة الرسولية\" (2/30)، والعلامة الطيب بن عبدالله بامخرمة (المتوفى سنة 947هـ) في كتابه: \"قلادة النحر في وفيات أعيان الدهر\" (6 / 170 ترجمة 3862).\r\n', 'sheikh.png'),
(9, 3, 'محمد بن عبدالرحمن بن أحمد باحسان الحضرمي الشبامي الملقب بالعطار ', 'وهو من الأعيان المذكورين لدى العلامة الطيب بن عبدالله بامخرمة (المتوفى سنة 947هـ) في كتابه: \"قلادة النحر في وفيات أعيان الدهر\" (6 / 288 ترجمة 4089)', 'sheikh.png'),
(10, 3, 'عبدالله بن محمد بن عبدالرحمن باحسان الحضرمي الملقب بالعفيف ', 'وهو من الأعيان المذكورين لدى العلامة الطيب بن عبدالله بامخرمة (المتوفى سنة 947هـ) في كتابه: \"قلادة النحر في وفيات أعيان الدهر\" (6 / 262 ترجمة4021)\r\n', 'sheikh.png'),
(11, 3, 'القاضي العلامة الفقيه الزاهد علي بن حسان (والد عبد الرحمن بن علي بن حسان)', 'كان قاضي الدولة الرسولية في ريدة المشقاص\r\n', 'sheikh.png'),
(12, 2, 'اشتهار حسن الأخلاق ومكارمها عند آل حسان', 'قال العلامة عبد الرحمن بن محمد الخطيب التريمي الأنصاري المتوفى سنة (855هـ) في كتابه: \"الجوهر الشفاف بمناقب السادة الأشراف\" (1/240) : حاكياً عن الفقيه عبد الله ابن الإمام العالم عبد الرحمن ابن الفقيه الزاهد علي بن حسان قال: \r\nكان جدي الفقيه علي بن حسان قاضياً في ريدة المشقاص، وكان سخياً كريماً، فإذا أتاه خصمان يحتكمان ووقع الحكم على معسر يقول جدي لخصمه: هذا معسر فاتركه يذهب لحال سبيله، وأنا أقضي عنه ما وجب عليه، فيتركه الخصم، ويقضي جدي عن المعسر، وهذا وأنه كان أيضاً يصلح فيما بين الناس. وكان حراثاً ماتت إبل حرثه بجربه فاحتاجوا إلى شيء من الإبل يسنون عليها زرعهم وأتوا إليه، وقالوا له: يا فقيه أعطنا شيئاً من الإبل من أباعرك نصلحه ونسنوا عليه، ونجعل لك ربع زرعنا أو نحو هذا، فقال لهم: ادخلوا الرصن واختاروا ما شئتم من الإبل، وكان إبله جرباء فدخلوا واختاروا منها بعيراً، وجعلوا يصلحونه، ويسنون عليه، فما فرغوا من سناوة ذلك الزرع، حتى بري البعير من جربه، وسمن وصار مليحاً، فلما جمعوا طعام ذلك الزرع، أتوا إلى جدي وقالوا له: عساك ترسل أحداً نعطيه نصيبك من الطعام، ويحمله إلى دارك، فقال: احفظوه عندكم', NULL),
(13, 2, 'اشتهار التفقه في آل حسان في الشحر وضواحيها في القرن 8', 'وقال العلامة علي بن أبي بكر السكران ابن الشيخ عبدالرحمن السقاف (المتوفى سنة 895هـ) في كتابه \"البرقة المشيقة في ذكر لباس الخرقة الأنيقة \" (ص121) : ومن الشحر: الفقهاء بنو السبتي، والفقهاء بنو شكيل، والفقهاء بنو حسان، الذين منهم القاضي محمد بن سعد شكيل، والإمام أبوبكر السبتي، والإمام عبدالرحمن السبتي، والإمام عبدالرحمن بن حسان.', NULL),
(14, 2, 'آل حسان في سيئون يحترفون الصياغة في القرن 13', 'وقال العلامة عبدالرحمن بن عبيد الله السقاف (المتوفي في عام 1375هـ) في كتابه \"إدام القوت في ذكر بلدان حضرموت\" (ص709) : عن آل حسان في سيئون: يحترفون بالصياغة، وكانت لهم منها ثروة - بالنخيل - ومواساة، ولكنهم على وشك التلاشي اليوم.\r\n', NULL),
(17, 4, 'وقال العلامة محمد بن علي بن عوض باحنان الكندي (المتوفي في عام1383 هـ) في كتابه \"جواهر تاريخ الأحقاف\" (2 /14) : ومن كندة آل أبي حسان.\r\n', NULL, NULL),
(18, 4, 'وكذا ذكر الأديب المؤرخ سعيد عوض باوزير (المتوفي في عام 1398هـ) في كتابه \"الفكر والثقافة في التاريخ الحضرمي\" (ص126)', NULL, NULL),
(19, 4, 'وما زال علماء ومؤرخو آل حسان يذكرون أنهم من ذرية الإمام القاضي عبد الرحمن بن علي بن حسان، وأنه يعود نسبهم إلى حسان بن معاوية بن ثور بن مرتع من كندة، وليس في العوائل والأسر الحضرمية من ينتسب إلى اسم \"حسان\" إلا هذه العائلة، باختلاف صيغ النسبة بحسب العادة والزمان \"آل حسان\" أو \"آل أبي حسان\" أو \"باحسان\" أو \"ابن حسان\" كما هو مبثوث في كتب التواريخ والأنساب، وأصحاب الشأن أعلم بأنسابهم، وهم ما زالوا متوافرين في المدن الحضرمية سيئون وشبام والريدة والقطن وغيرها، بل ما زال لهم وجود في زبيد من القرن الثامن الهجري، ومنهم من لحق بالدولة الأيوبية في مصر والشام، ثم الدولة الرسولية في جنوب الجزيرة العربية.', NULL, NULL),
(20, 4, 'وللعلم فإن هناك عوائل تنتسب إلى \"آل حسان\" من خارج حضرموت، منهم بنو حسان في إقليم الجند بتعز (جبل حبشي) وهم ينتسبون إلى الصحابي الجليل حسان بن ثابت الخزرجي الأنصاري كما ذكر العلامة بهاء الدين الجندي في (السلوك في طبقات العلماء والملوك) (1/393) (2/91)، وآل حسان بجيلة من بني مالك جنوب الطائف، وهناك بنو حسان في بلاد المغرب الأقصى (المغرب وموريتانيا)، وآل حسان شيوخ قبيلة الأسلم أحد بطون قبيلة شمر في شمال الجزيرة العربية والعراق، وهناك بيت حسان في فلسطين وهي أسرة عريقة مباركة، وهناك عائلة آل حسان وهي مشهورة في صعيد مصر.\r\n', NULL, NULL),
(33, 1, 'test', 'test', NULL),
(35, 1, 'asdfaf', 'asdfasdf', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `family_members`
--

CREATE TABLE `family_members` (
  `id` int(225) NOT NULL,
  `name` varchar(100) NOT NULL,
  `father_id` int(225) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `family_members`
--

INSERT INTO `family_members` (`id`, `name`, `father_id`) VALUES
(1, 'سعيد', NULL),
(2, 'سالم', NULL),
(3, 'عبود', NULL),
(4, 'سعيد', NULL),
(5, 'عبدالله', 1),
(6, 'محمد', 1),
(7, 'عبدالله', 2),
(8, 'بكران', 2),
(9, 'عمر', 3),
(10, 'محمد', 3),
(11, 'سالم', 3),
(12, 'احمد', 4),
(13, 'حسن', 4),
(14, 'بكران', 4),
(15, 'احمد', 5),
(16, 'سالم', 6),
(17, 'عمر', 6),
(18, 'سالم', 7),
(19, 'سالم', 8),
(20, 'عبدالله', 9),
(21, 'محمد', 9),
(22, 'سالم', 9),
(23, 'احمد', 10),
(24, 'عبدالله', 10),
(25, 'عوض', 10),
(26, 'احمد', 11),
(27, 'محمد', 11),
(28, 'عمر', 11),
(29, 'سعيد', 12),
(30, 'عبدالرحمن', 12),
(31, 'سالم', 13),
(32, 'عمر', 13),
(33, 'محمد', 13),
(34, 'احمد', 13),
(35, 'علي', 13),
(36, 'سعيد', 13),
(37, 'بكران', 13),
(38, 'سالم', 14),
(39, 'احمد', 14),
(40, 'سعيد', 14),
(41, 'عمر', 14),
(42, 'سعيد', 15),
(43, 'حسن', 15),
(44, 'علي', 15),
(45, 'عبدالله', 15),
(46, 'عبدالرحمن', 15),
(47, 'عمر', 15),
(48, 'محمد', 15),
(49, 'طاهر', 15),
(50, 'عمر', 16),
(51, 'عبدالله', 16),
(52, 'محمد', 17),
(53, 'سعيد', 17),
(54, 'احمد', 18),
(55, 'عمر', 19),
(56, 'عبدالله', 19),
(57, 'عمر', 21),
(58, 'عبود', 22),
(59, 'حسان', 23),
(60, 'عمر', 23),
(61, 'محمد', 23),
(62, 'سالم', 25),
(63, 'عيدالله', 25),
(64, 'محمد', 25),
(65, 'سالم', 26),
(66, 'سالم', 27),
(67, 'سالم', 28),
(68, 'سعيد', 28),
(69, 'سعيد', 31),
(70, 'عبدالقادر', 32),
(71, 'عبدالله', 33),
(72, 'سعيد', 33),
(73, 'حسن', 33),
(74, 'سالم', 34),
(75, 'علي', 34),
(76, 'حسن', 34),
(77, 'سعيد', 34),
(78, 'حسن', 35),
(79, 'عمر', 35),
(80, 'محمد', 35),
(81, 'احمد', 35),
(82, 'عبدالله', 35),
(83, 'عبدالله', 36),
(84, 'محمد', 36),
(85, 'محمد', 37),
(86, 'سالم', 37),
(87, 'سعيد', 37),
(88, 'عوض', 38),
(89, 'سعيد', 38),
(90, 'عبدالقادر', 38),
(91, 'عبدالقادر', 39),
(92, 'عبدالله', 39),
(93, 'سالم', 39),
(94, 'حسان', 39),
(95, 'عبدالرحمن', 39),
(96, 'سالم', 40),
(97, 'عبدالقادر', 40),
(98, 'حسن', 40),
(99, 'سالم', 41),
(100, 'محمد', 41),
(101, 'احمد', 41),
(102, 'سعيد', 41),
(103, 'عبدالله', 41),
(104, 'محمد', 34),
(105, 'حسن', 39),
(106, 'عبدالرحمن', 45),
(107, 'احمد', 46),
(115, 'عبدالله', 47),
(116, 'احمد', 47),
(117, 'محمد', 47),
(118, 'علي', 47),
(119, 'سالم', 47),
(120, 'سعيد', 47),
(121, 'حسن', 47),
(122, 'عبدالقادر', 48),
(123, 'سالم', 48),
(124, 'احمد', 48),
(125, 'حسن', 48),
(126, 'عبدالله', 48),
(127, 'سالم', 49),
(128, 'محمد', 49),
(129, 'سعيد', 49),
(130, 'محمد', 51),
(131, 'سعيد', 52),
(132, 'عمر', 52),
(133, 'عبدالقادر', 53),
(134, 'سالم', 54),
(135, 'سعيد', 55),
(136, 'سالم', 55),
(137, 'سعيد', 56),
(138, 'احمد', 57),
(139, 'عبدالرحمن', 57),
(140, 'ابوبكر', 58),
(141, 'سالم', 58),
(142, 'عوض', 62),
(143, 'عمران', 62),
(144, 'حسان', 63),
(145, 'عمر', 63),
(146, 'محمد', 63),
(147, 'عبدالله', 64),
(148, 'عبود', 64),
(149, 'عوض', 64),
(150, 'احمد', 64),
(151, 'بكران', 64),
(152, 'سعيد', 64),
(153, 'محمد', 66),
(154, 'حسن', 68),
(155, 'عمر', 70),
(156, 'محفوظ', 70),
(157, 'احمد', 71),
(158, 'سعيد', 71),
(159, 'سالم', 72),
(160, 'محمود', 72),
(161, 'سالم', 73),
(162, 'محمد', 73),
(163, 'احمد', 73),
(164, 'عبدالله', 73),
(165, 'عيظه', 74),
(166, 'عبدالله', 74),
(167, 'احمد', 75),
(168, 'احمد', 76),
(169, 'كرامة', 76),
(170, 'احمد', 77),
(171, 'حسن', 77),
(172, 'حسن', 78),
(173, 'احمد', 79),
(174, 'احمد', 80),
(175, 'عبدالرحمن', 81),
(176, 'محمد', 81),
(177, 'سعيد', 83),
(178, 'عبدالله', 84),
(179, 'سعيد', 84),
(180, 'سالم', 85),
(181, 'عبدالرحمن', 87),
(182, 'حسن', 87),
(183, 'سالم', 87),
(184, 'عبدالرحمن', 89),
(185, 'محمد', 89),
(186, 'احمد', 89),
(187, 'محفوظ', 90),
(188, 'احمد', 90),
(189, 'سعيد', 91),
(190, 'عمر', 91),
(191, 'عبدالله', 91),
(192, 'عمر', 92),
(193, 'حامد', 93),
(194, 'ابوبكر', 93),
(195, 'احمد', 93),
(196, 'محمد', 105),
(197, 'عبدالله', 94),
(198, 'محمد', 95),
(199, 'حسن', 95),
(200, 'سالم', 95),
(201, 'عبدالقادر', 95),
(202, 'سالم', 97),
(203, 'عاشور', 97),
(204, 'سعيد', 98),
(205, 'عمر', 101),
(206, 'محمد', 101),
(207, 'سالم', 102),
(208, 'عبدالقادر', 103),
(209, 'احمد', 103);

-- --------------------------------------------------------

--
-- Table structure for table `headline`
--

CREATE TABLE `headline` (
  `h_id` int(255) NOT NULL,
  `temp_id` int(225) NOT NULL,
  `sort_order` int(255) NOT NULL DEFAULT 0,
  `title` varchar(1000) NOT NULL,
  `intro` varchar(1000) DEFAULT NULL,
  `logo_img` varchar(255) DEFAULT NULL,
  `main_img` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `headline`
--

INSERT INTO `headline` (`h_id`, `temp_id`, `sort_order`, `title`, `intro`, `logo_img`, `main_img`) VALUES
(1, 1, 2, ' أهمية معرفة الأنساب', 'الحمدلله bb', 'importance.png', NULL),
(2, 4, 3, 'أخبار آل حسان ', NULL, 'news.png', NULL),
(3, 2, 4, 'من أعيان آل حسان', NULL, 'personall.png', NULL),
(4, 3, 1, ' التعريف بآل حسان', 'te', 'intro.png', 'poem.png');

-- --------------------------------------------------------

--
-- Table structure for table `resources`
--

CREATE TABLE `resources` (
  `id` int(255) NOT NULL,
  `name` varchar(255) NOT NULL,
  `link` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `template`
--

CREATE TABLE `template` (
  `temp_id` int(255) NOT NULL,
  `temp_name` varchar(255) NOT NULL,
  `temp_img` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `template`
--

INSERT INTO `template` (`temp_id`, `temp_name`, `temp_img`) VALUES
(1, 'قالب 1', 'temp1.png'),
(2, 'قالب 2', 'temp2.png'),
(3, 'قالب 3', 'temp3.png'),
(4, 'قالب 4', 'temp4.png');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(255) NOT NULL,
  `username` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `password`) VALUES
(1, 'test', '$2y$10$c0OsUxBd5WJVNZV7sVYzruuRpgOrUEc7HSCwi5rj3QIqybwkZ8gRa');

-- --------------------------------------------------------

--
-- Table structure for table `visits`
--

CREATE TABLE `visits` (
  `id` int(11) NOT NULL,
  `visit_count` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `visits`
--

INSERT INTO `visits` (`id`, `visit_count`) VALUES
(1, 11);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `content`
--
ALTER TABLE `content`
  ADD PRIMARY KEY (`c_id`),
  ADD KEY `h_id` (`h_id`),
  ADD KEY `c_id` (`c_id`);

--
-- Indexes for table `family_members`
--
ALTER TABLE `family_members`
  ADD PRIMARY KEY (`id`),
  ADD KEY `father_id` (`father_id`);

--
-- Indexes for table `headline`
--
ALTER TABLE `headline`
  ADD PRIMARY KEY (`h_id`),
  ADD KEY `h_id` (`h_id`) USING BTREE,
  ADD KEY `temp` (`temp_id`);

--
-- Indexes for table `resources`
--
ALTER TABLE `resources`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `template`
--
ALTER TABLE `template`
  ADD PRIMARY KEY (`temp_id`),
  ADD KEY `temp_id` (`temp_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `visits`
--
ALTER TABLE `visits`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `content`
--
ALTER TABLE `content`
  MODIFY `c_id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=36;

--
-- AUTO_INCREMENT for table `family_members`
--
ALTER TABLE `family_members`
  MODIFY `id` int(225) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=214;

--
-- AUTO_INCREMENT for table `headline`
--
ALTER TABLE `headline`
  MODIFY `h_id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `resources`
--
ALTER TABLE `resources`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `template`
--
ALTER TABLE `template`
  MODIFY `temp_id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `visits`
--
ALTER TABLE `visits`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `content`
--
ALTER TABLE `content`
  ADD CONSTRAINT `content_ibfk_1` FOREIGN KEY (`h_id`) REFERENCES `headline` (`h_id`);

--
-- Constraints for table `family_members`
--
ALTER TABLE `family_members`
  ADD CONSTRAINT `family_members_ibfk_1` FOREIGN KEY (`father_id`) REFERENCES `family_members` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `headline`
--
ALTER TABLE `headline`
  ADD CONSTRAINT `headline_ibfk_1` FOREIGN KEY (`temp_id`) REFERENCES `template` (`temp_id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
